music_app/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "KQO5rvk1Vig3AozHy2Rifw"], ["updated_at", "2019-08-06 21:15:14.334625"], ["id", 1]]
---
    def reset_session_token!
        #reset the user's session token and save it to the db.
        self.session_token = SecureRandom::urlsafe_base64(16)
        self.save