music_app/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
    def create
        #User.new(user: {email: 'qwer', password: '123456'})
        @user = User.new(user_params)

        if @user.save!